Repository: matthew-a-klein/TaskTether
Catalog: TaskTether/TaskTether/Resources/Localizable.xcstrings
Source language: en
Languages: ar, hu

# connect.button.idle
source: Connect Google Account
ar: ربط حساب Google
hu: Google-fiók összekapcsolása

# connect.button.loading
source: Connecting...
ar: جارٍ الاتصال…
hu: Kapcsolódás…

# connect.description
source: Sync Apple Reminders with Google Tasks seamlessly.
ar: زامن تذكيرات Apple مع مهام Google بسلاسة.
hu: Szinkronizáld az Apple Emlékeztetőket a Google Feladatokkal.

# error.auth.token
source: Token exchange failed
ar: فشل تبادل الرمز
hu: Token csere sikertelen

# error.auth.url
source: Could not build auth URL
ar: تعذّر إنشاء رابط المصادقة
hu: Nem sikerült létrehozni a hitelesítési URL-t

# error.credentials
source: Could not load credentials
ar: تعذّر تحميل بيانات الاعتماد
hu: Nem sikerült betölteni a hitelesítő adatokat

# error.reminders.createlist
source: Could not create TaskTether list: %@
ar: تعذّر إنشاء قائمة TaskTether: %@
hu: Nem sikerült létrehozni a TaskTether listát: %@

# error.reminders.denied.v12
source: Reminders access denied. Please enable in System Preferences → Security & Privacy → Reminders.
ar: تم رفض الوصول إلى التذكيرات. يُرجى التفعيل من تفضيلات النظام ← الأمان والخصوصية ← التذكيرات.
hu: Az Emlékeztetők hozzáférése megtagadva. Engedélyezd a Rendszerbeállítások → Biztonság és adatvédelem → Emlékeztetők menüpontban.

# error.reminders.denied.v14
source: Reminders access denied. Please enable in System Settings → Privacy → Reminders.
ar: تم رفض الوصول إلى التذكيرات. يُرجى التفعيل من إعدادات النظام ← الخصوصية ← التذكيرات.
hu: Az Emlékeztetők hozzáférése megtagadva. Engedélyezd a Rendszerbeállítások → Adatvédelem → Emlékeztetők menüpontban.

# error.tasks.createlist
source: Could not create TaskTether list
ar: تعذّر إنشاء قائمة TaskTether
hu: Nem sikerült létrehozni a TaskTether listát

# error.tasks.fetchlists
source: Could not fetch task lists
ar: تعذّر جلب قوائم المهام
hu: Nem sikerült lekérni a feladatlistákat

# error.tasks.notoken
source: No access token
ar: لا يوجد رمز وصول
hu: Nincs hozzáférési token

# expanded.delta.down
source: ↓ %lld%% vs yesterday
ar: ↓ %lld%% مقارنةً بالأمس
hu: ↓ %lld%% tegnap képest

# expanded.delta.up
source: ↑ +%lld%% vs yesterday
ar: ↑ +%lld%% مقارنةً بالأمس
hu: ↑ +%lld%% tegnap képest

# expanded.label.last7days
source: Last 7 Days
ar: آخر 7 أيام
hu: Elmúlt 7 nap

# expanded.label.today
source: Today
ar: اليوم
hu: Ma

# expanded.label.yesterday
source: Yesterday
ar: أمس
hu: Tegnap

# expanded.tasks.done
source: tasks done
ar: مهام منجزة
hu: feladat kész

# general.quit
source: Quit
ar: إنهاء
hu: Kilépés

# nav.compact
source: Compact
ar: مضغوط
hu: Kompakt

# nav.expanded
source: Expanded
ar: موسّع
hu: Kibővített

# nav.today
source: Today
ar: اليوم
hu: Ma

# service.googletasks
source: Google Tasks
ar: مهام Google
hu: Google Feladatok

# service.reminders
source: Reminders
ar: التذكيرات
hu: Emlékeztetők

# settings.account.google
source: Google account
ar: حساب Google
hu: Google-fiók

# settings.alert.ok
source: OK
ar: حسناً

# settings.appearance.dark
source: Always Dark
ar: داكن دائماً
hu: Mindig sötét

# settings.appearance.label
source: Mode
ar: الوضع
hu: Mód

# settings.appearance.light
source: Always Light
ar: فاتح دائماً
hu: Mindig világos

# settings.appearance.system
source: System
ar: النظام
hu: Rendszer

# settings.customtheme.description
source: Load a community theme from a JSON file.
ar: تحميل مظهر مجتمعي من ملف JSON.
hu: Közösségi téma betöltése JSON fájlból.

# settings.customtheme.error.title
source: Could not load theme
ar: تعذّر تحميل المظهر
hu: A téma nem tölthető be

# settings.customtheme.load
source: Load theme from file…
ar: تحميل مظهر من ملف…
hu: Téma betöltése fájlból…

# settings.customtheme.panel.title
source: Choose a theme file
ar: اختر ملف مظهر
hu: Válassz témafájlt

# settings.language.label
source: Language
ar: اللغة
hu: Nyelv

# settings.language.restart_hint
source: Language changes take effect after restarting TaskTether.
ar: تصبح تغييرات اللغة سارية بعد إعادة تشغيل TaskTether.
hu: A nyelvi változtatások a TaskTether újraindítása után lépnek életbe.

# settings.language.system
source: System Default
ar: لغة النظام الافتراضية
hu: Rendszer alapértelmezett

# settings.section.account
source: Account
ar: الحساب
hu: Fiók

# settings.section.appearance
source: Appearance
ar: المظهر
hu: Megjelenés

# settings.section.customtheme
source: Custom Themes
ar: مظاهر مخصصة
hu: Egyéni témák

# settings.section.language
source: Language
ar: اللغة
hu: Nyelv

# settings.dock.label
source: Show icon in Dock
ar: إظهار الأيقونة في الـ Dock
hu: Dock-ikon megjelenítése

# settings.dock.restart_hint
source: Takes effect after restarting TaskTether.
ar: تصبح التغييرات سارية بعد إعادة تشغيل TaskTether.
hu: A változtatás a TaskTether újraindítása után lép életbe.

# settings.section.support
source: Support TaskTether
ar: دعم TaskTether
hu: TaskTether támogatása

# settings.section.sync
source: Sync
ar: المزامنة
hu: Szinkronizálás

# settings.section.theme
source: Theme
ar: المظهر
hu: Téma

# settings.signout
source: Sign Out
ar: تسجيل الخروج
hu: Kijelentkezés

# settings.support.description
source: TaskTether is free and open source.
ar: TaskTether مجاني ومفتوح المصدر.
hu: A TaskTether ingyenes és nyílt forráskódú.

# settings.support.link
source: Buy me a coffee ☕️
ar: اشترِ لي قهوة ☕️
hu: Vegyél nekem egy kávét ☕️

# settings.sync.interval
source: Sync interval
ar: فترة المزامنة
hu: Szinkronizálási időköz

# settings.sync.interval.minutes
source: %d minutes
ar: %d دقائق
hu: %d perc

# settings.tab.general
source: General
ar: عام
hu: Általános

# settings.theme.dark
source: Dark theme
ar: المظهر الداكن
hu: Sötét téma

# settings.theme.light
source: Light theme
ar: المظهر الفاتح
hu: Világos téma

# status.connected
source: Connected
ar: متصل
hu: Csatlakozva

# status.error
source: Error
ar: خطأ
hu: Hiba

# status.syncing
source: Syncing
ar: جارٍ المزامنة
hu: Szinkronizálás

# sync.button
source: Sync Now
ar: مزامنة الآن
hu: Szinkronizálás most

# sync.button.loading
source: Syncing…
ar: جارٍ المزامنة…
hu: Szinkronizálás…

# sync.last.never
source: Last synced: Never
ar: آخر مزامنة: أبداً
hu: Utolsó szinkronizálás: Soha

# sync.strip.label
source: Last sync
ar: آخر مزامنة
hu: Utolsó szinkronizálás

# task.tomorrow.hint
source: Tomorrow
ar: غداً
hu: Holnap

# today.add.placeholder
source: New task…
ar: مهمة جديدة…
hu: Új feladat…

# today.add.tooltip
source: Add task
ar: إضافة مهمة
hu: Feladat hozzáadása

# today.empty.subtitle
source: Nothing due in your TaskTether list today.
ar: لا توجد مهام مستحقة في قائمة TaskTether اليوم.
hu: Nincs esedékes feladat a TaskTether listádban ma.

# today.empty.title
source: You’re all caught up.
ar: أنجزت كل شيء.
hu: Minden feladattal készen vagy.

# tooltip.googletasks.connected
source: Google Tasks: Connected
ar: مهام Google: متصل
hu: Google Feladatok: Csatlakozva

# tooltip.googletasks.disconnected
source: Google Tasks: Not connected
ar: مهام Google: غير متصل
hu: Google Feladatok: Nincs csatlakoztatva

# tooltip.quit
source: Quit TaskTether
ar: إنهاء TaskTether
hu: TaskTether bezárása

# tooltip.reminders.connected
source: Reminders: Connected
ar: التذكيرات: متصل
hu: Emlékeztetők: Csatlakozva

# tooltip.reminders.disconnected
source: Reminders: Not connected
ar: التذكيرات: غير متصل
hu: Emlékeztetők: Nincs csatlakoztatva

# tooltip.settings
source: Settings
ar: الإعدادات
hu: Beállítások

# settings.section.dock
source: Dock
hu: Dok
